Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_gateway_response.default_4xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_4xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_gateway_response.default_5xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_5xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "1km1k3" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.create_feed_post_log_group will be created
+ resource "aws_cloudwatch_log_group" "create_feed_post_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/create_feed_post"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_iam_role_policy.ecs_task_sfn_callbacks will be created
+ resource "aws_iam_role_policy" "ecs_task_sfn_callbacks" {
      + id          = (known after apply)
      + name        = "ecs-task-sfn-callbacks"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "states:SendTaskSuccess",
                          + "states:SendTaskFailure",
                          + "states:SendTaskHeartbeat",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_ecs_task_role"
    }

  # aws_iam_role_policy.sfn_runs_ecs will be created
+ resource "aws_iam_role_policy" "sfn_runs_ecs" {
      + id          = (known after apply)
      + name        = "sfn-run-ecs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:RunTask",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_carousel:1"
                    },
                  + {
                      + Action   = [
                          + "ecs:DescribeTasks",
                          + "ecs:StopTask",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                          + "events:RemoveTargets",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:us-east-2:825765422855:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          + "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_step_functions_role"
    }

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "sharedservices_step_functions_role:sharedservices_step_functions_policy"
        name        = "sharedservices_step_functions_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:InvokeFunction",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:lambda:us-east-2:825765422855:function:get_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:delete_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:notify_post",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                          + "logs:CreateLogDelivery",
                          + "logs:GetLogDelivery",
                          + "logs:UpdateLogDelivery",
                          + "logs:DeleteLogDelivery",
                          + "logs:ListLogDeliveries",
                          + "logs:PutResourcePolicy",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                        ]
                      ~ Resource = [
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:6",
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:33",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "events:RemoveTargets",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:*:*:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  + {
                      + Action   = [
                          + "ecs:RunTask",
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:6"
                    },
                    {
                        Action    = "iam:PassRole"
                        Condition = {
                            StringEquals = {
                                "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.manual_carousel_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "manual_carousel_workflow" {
      ~ definition                = jsonencode(
          ~ {
              ~ Comment = "State machine for the manual carousel post workflow" -> "Manual carousel workflow"
              ~ States  = {
                  ~ DeleteLogo     = {
                      + End        = true
                      + InputPath  = "$"
                      - Next       = "NotifyUser"
                      ~ ResultPath = "$.deleteLogoResult" -> "$.deleteResult"
                        # (2 unchanged attributes hidden)
                    }
                  ~ GetLogo        = {
                      + InputPath  = "$"
                        # (4 unchanged attributes hidden)
                    }
                  + NotifyFailure  = {
                      + Next       = "DeleteLogo"
                      + Parameters = {
                          + "accountName.$" = "$.accountName"
                          + "error.$"       = "$.renderError"
                        }
                      + Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      + ResultPath = "$.notifyResult"
                      + Type       = "Task"
                    }
                  + NotifySuccess  = {
                      + InputPath  = "$"
                      + Next       = "DeleteLogo"
                      + Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      + ResultPath = "$.notifyResult"
                      + Type       = "Task"
                    }
                  - NotifyUser     = {
                      - End        = true
                      - InputPath  = "$"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  ~ RenderCarousel = {
                      + Catch          = [
                          + {
                              + ErrorEquals = [
                                  + "States.ALL",
                                ]
                              + Next        = "NotifyFailure"
                              + ResultPath  = "$.renderError"
                            },
                        ]
                      ~ Next           = "DeleteLogo" -> "NotifySuccess"
                      ~ Parameters     = {
                          ~ Overrides            = {
                              ~ ContainerOverrides = [
                                  ~ {
                                      ~ Environment = [
                                          - {
                                              - Name      = "EVENT_JSON"
                                              - "Value.$" = "States.JsonToString($)"
                                            },
                                            {
                                                Name      = "TASK_TOKEN"
                                                "Value.$" = "$$.Task.Token"
                                            },
                                          + {
                                              + Name      = "EVENT_JSON"
                                              + "Value.$" = "States.JsonToString($)"
                                            },
                                        ]
                                        # (1 unchanged attribute hidden)
                                    },
                                ]
                            }
                            # (4 unchanged attributes hidden)
                        }
                      - ResultPath     = "$.carouselResult"
                      + TimeoutSeconds = 7200
                        # (2 unchanged attributes hidden)
                    }
                }
                # (1 unchanged attribute hidden)
            }
        )
        id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_carousel_workflow"
        name                      = "manual_carousel_workflow"
      ~ tags                      = {
          + "Project" = "sharedservices"
        }
        # (12 unchanged attributes hidden)

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 5 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 3 to add, 5 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```